# Pandas DataFrame pop and drop for columns

# <font color="red"> pop()

This method is used to remove the column from the dataframe

In [1]:
import pandas as pd

In [2]:
data = pd.DataFrame({
    "Name":["Archana","Mani","Kalpana","Thiru"],
    "Age":[23,24,32,31],
    "City":["Salem","Coimbatore","Madurai","Trichy"]
})

In [3]:
data

      Name  Age        City
0  Archana   23       Salem
1     Mani   24  Coimbatore
2  Kalpana   32     Madurai
3    Thiru   31      Trichy

# First method

In [4]:
data.pop("Age")

0    23
1    24
2    32
3    31
Name: Age, dtype: int64

In [5]:
data

      Name        City
0  Archana       Salem
1     Mani  Coimbatore
2  Kalpana     Madurai
3    Thiru      Trichy

# Second method

# <font color="red">drop()

In [6]:
data = pd.DataFrame({
    "Name":["Archana","Mani","Kalpana","Thiru"],
    "Age":[23,24,32,31],
    "City":["Salem","Coimbatore","Madurai","Trichy"]
})

In [7]:
data

      Name  Age        City
0  Archana   23       Salem
1     Mani   24  Coimbatore
2  Kalpana   32     Madurai
3    Thiru   31      Trichy

In [8]:
data.drop("Age", axis = 1) # axis is must for drop()

      Name        City
0  Archana       Salem
1     Mani  Coimbatore
2  Kalpana     Madurai
3    Thiru      Trichy

In [9]:
data

      Name  Age        City
0  Archana   23       Salem
1     Mani   24  Coimbatore
2  Kalpana   32     Madurai
3    Thiru   31      Trichy

In [10]:
# pop() - This method will return the removed column

In [11]:
# drop() - This method will return the entire column except the deleted column.(axis is must)